tap "fabianishere/personal"
tap "gcenx/wine"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "kardolus/chatgpt-cli"
tap "koekeishiya/formulae"
tap "laishulu/homebrew"
tap "mesca/luarocks"
tap "rconroy293/seventeenlands"
tap "teamookla/speedtest"
tap "zegervdv/zathura"
brew "libpng"
brew "gettext"
brew "sqlite"
brew "xz"
brew "webp"
brew "aom"
brew "aria2"
brew "aspell"
brew "astyle"
brew "audiofile"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "bc"
brew "bear"
brew "binwalk"
brew "bison"
brew "btop"
brew "cabextract"
brew "z3"
brew "ccls"
brew "gcc"
brew "ceres-solver"
brew "cf"
brew "cf-tool", link: false
brew "clang-format"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cppcheck"
brew "pkg-config"
brew "crystal"
brew "ctags"
brew "curl"
brew "docker", link: false
brew "docker-compose", link: false
brew "doxygen"
brew "entr"
brew "node", link: false
brew "eslint"
brew "libgit2"
brew "eza"
brew "fastfetch"
brew "fd"
brew "zeromq"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "flex"
brew "foremost"
brew "fzf"
brew "gawk"
brew "gdb"
brew "geckodriver"
brew "gh"
brew "git", link: false
brew "git-cola"
brew "glab"
brew "gnu-getopt"
brew "gnu-sed"
brew "go"
brew "libtool"
brew "graphviz"
brew "lua"
brew "highlight"
brew "htop"
brew "httpd", restart_service: true
brew "hugo"
brew "imagemagick"
brew "ipmitool"
brew "jinja2-cli"
brew "jq"
brew "lazygit"
brew "libsecret"
brew "lima"
brew "lolcat"
brew "lsd"
brew "openjdk"
brew "ltex-ls"
brew "lua-language-server"
brew "luarocks"
brew "macvim"
brew "mono"
brew "n"
brew "nats-server"
brew "tcl-tk"
brew "python@3.8"
brew "neofetch"
brew "neovim"
brew "nowplaying-cli"
brew "nyancat"
brew "pugixml"
brew "opencv"
brew "pipenv"
brew "pipes-sh"
brew "pipx"
brew "poppler"
brew "prettier"
brew "putty"
brew "pyenv"
brew "pyright", link: false
brew "python@3.9"
brew "python-tk@3.9"
brew "python-yq", link: false
brew "python@2", link: false
brew "python@3.11"
brew "ripgrep"
brew "s-search"
brew "screenfetch"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "silicon"
brew "sl"
brew "socat"
brew "spotify-tui"
brew "stow"
brew "stylua"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "typescript"
brew "unzip"
brew "wget"
brew "winetricks"
brew "yarn"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fabianishere/personal/pam_reattach"
brew "heroku/brew/heroku"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "kardolus/chatgpt-cli/chatgpt-cli"
brew "laishulu/homebrew/macism"
brew "rconroy293/seventeenlands/seventeenlands"
brew "teamookla/speedtest/speedtest"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "alacritty"
cask "altserver"
cask "docker"
cask "fluor"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gitnote"
cask "google-cloud-sdk"
cask "gstreamer-runtime"
cask "hammerspoon"
cask "keycastr"
cask "maccy"
cask "macdown"
cask "mactex"
cask "ngrok"
cask "numi"
cask "obs"
cask "rectangle"
cask "skim"
cask "smcfancontrol"
cask "temurin"
cask "visual-studio-code"
cask "wezterm@nightly"
cask "xquartz"
cask "zed"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "enkia.tokyo-night"
vscode "mitaki28.vscode-clang"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "saekiraku.rainbow-fart"
vscode "twxs.cmake"
