tap "fabianishere/personal"
tap "gcenx/wine"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mesca/luarocks"
tap "rconroy293/seventeenlands"
tap "teamookla/speedtest"
# Library for manipulating PNG images
brew "libpng"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Source code beautifier for C, C++, C#, and Java
brew "astyle"
# Reads and writes many common audio file formats
brew "audiofile"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU compiler collection
brew "gcc"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Extract files from Microsoft cabinet files
brew "cabextract"
# High-performance theorem prover
brew "z3"
# C/C++/ObjC language server
brew "ccls"
# C++ library for large-scale optimization
brew "ceres-solver"
# Filter to replace numeric timestamps with a formatted date time
brew "cf"
# Command-line tool for Codeforces contests
brew "cf-tool", link: false
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake", link: false
# Static analysis of C and C++ code
brew "cppcheck"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# Generate documentation for several programming languages
brew "doxygen"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# High-performance, asynchronous messaging library
brew "zeromq"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Console program to recover files based on their headers and footers
brew "foremost"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Distributed revision control system
brew "git", link: false
# Command-line option parsing utility
brew "gnu-getopt"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd", restart_service: true
# Configurable static site generator
brew "hugo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Utility for IPMI control with kernel driver or LAN interface
brew "ipmitool"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Library for storing/retrieving passwords and other secrets
brew "libsecret"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# GUI for vim, made for macOS
brew "macvim"
# Cross platform, open source .NET development framework
brew "mono"
# Lightweight cloud messaging system
brew "nats-server"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node", link: false
# Light-weight C++ XML processing library
brew "pugixml"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk"
# Python dependency management tool
brew "pipenv"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Implementation of Telnet and SSH
brew "putty"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Command-line YAML and XML processor that wraps jq
brew "python-yq", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Web search from the terminal
brew "s-search"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# SOcket CAT: netcat on steroids
brew "socat"
# Terminal-based client for Spotify
brew "spotify-tui"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "fabianishere/personal/pam_reattach"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Utility to upload MTG Arena data to 17Lands.com
brew "rconroy293/seventeenlands/seventeenlands"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# GPU-accelerated terminal emulator
cask "alacritty"
# iOS App Store alternative
cask "altserver"
cask "clyang-welly"
# App to build and share containerized applications and microservices
cask "docker"
# Change the behavior of the fn keys depending on the active application
cask "fluor"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Open-source keystroke visualizer
cask "keycastr"
# Clipboard manager
cask "maccy"
# Open-source Markdown editor
cask "macdown"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Calculator and converter application
cask "numi"
# Open-source software for live streaming and screen recording
cask "obs"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
# Open-source code editor
cask "visual-studio-code"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "enkia.tokyo-night"
vscode "mitaki28.vscode-clang"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "saekiraku.rainbow-fart"
vscode "twxs.cmake"
